In [100]:
import pandas as pd

# 예시 데이터: 회원 이름과 가입일
data = {
    'NAME': ['김철수', '이영희', '박민수', '최지우'],
    'JOIN_DATE': ['2023-05-01', '2024-01-15', '2024-12-01', '2025-05-20'], 
    'EXIT_DATE': ['2024:05:01', '2025:01:15', '2025:12:01', '2025:05:23'],     
}

today = '2026-05-27'

df = pd.DataFrame(data)

df

  NAME   JOIN_DATE   EXIT_DATE
0  김철수  2023-05-01  2024:05:01
1  이영희  2024-01-15  2025:01:15
2  박민수  2024-12-01  2025:12:01
3  최지우  2025-05-20  2025:05:23

In [101]:
df.info() # JOIN_DATE is object

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
NAME         4 non-null object
JOIN_DATE    4 non-null object
EXIT_DATE    4 non-null object
dtypes: object(3)
memory usage: 224.0+ bytes

In [102]:
# datetime으로 변환
df['JOIN_DATE'] = pd.to_datetime(df['JOIN_DATE'])
df['EXIT_DATE'] = pd.to_datetime(df['EXIT_DATE'], format='%Y:%m:%d') # %H:%M:%S

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
NAME         4 non-null object
JOIN_DATE    4 non-null datetime64[ns]
EXIT_DATE    4 non-null datetime64[ns]
dtypes: datetime64[ns](2), object(1)
memory usage: 224.0+ bytes

In [103]:
df

  NAME  JOIN_DATE  EXIT_DATE
0  김철수 2023-05-01 2024-05-01
1  이영희 2024-01-15 2025-01-15
2  박민수 2024-12-01 2025-12-01
3  최지우 2025-05-20 2025-05-23

In [104]:
from datetime import datetime

datetime.strptime(today, '%Y-%m-%d')

datetime.datetime(2026, 5, 27, 0, 0)

In [105]:
# today를 기준으로 경과일 구하기
# datetime이 아닌 경우 strptime 사용
# df['JOIN_DATE'].map(lambda x: (datetime.strptime(today, '%Y-%m-%d') - datetime.strptime(x, '%Y-%m-%d')).days)
df['JOIN_DATE'].map(lambda x: (datetime.strptime(today, '%Y-%m-%d') - x).days)

0    1122
1     863
2     542
3     372
Name: JOIN_DATE, dtype: int64

In [106]:
# 데이터 분할 dt
df['JOIN_YEAR'] = df['JOIN_DATE'].dt.year # month, day, hour, minute, second, dayofweek
df

  NAME  JOIN_DATE  EXIT_DATE  JOIN_YEAR
0  김철수 2023-05-01 2024-05-01       2023
1  이영희 2024-01-15 2025-01-15       2024
2  박민수 2024-12-01 2025-12-01       2024
3  최지우 2025-05-20 2025-05-23       2025

In [107]:
# 특정 시점과 구간
df['JOIN_Q'] = df['JOIN_DATE'].dt.to_period('Q') # Y, Q, M, D, H
df

  NAME  JOIN_DATE  EXIT_DATE  JOIN_YEAR  JOIN_Q
0  김철수 2023-05-01 2024-05-01       2023  2023Q2
1  이영희 2024-01-15 2025-01-15       2024  2024Q1
2  박민수 2024-12-01 2025-12-01       2024  2024Q4
3  최지우 2025-05-20 2025-05-23       2025  2025Q2

In [108]:
# 오늘과 차이
diff = datetime.strptime(today, '%Y-%m-%d') - df['JOIN_DATE']
diff

0   1122 days
1    863 days
2    542 days
3    372 days
Name: JOIN_DATE, dtype: timedelta64[ns]

In [109]:
# 더하기
hour = pd.Timedelta(hours=10)
df['JOIN_DATE_H'] = df['JOIN_DATE'] + hour
df

  NAME  JOIN_DATE  EXIT_DATE  JOIN_YEAR  JOIN_Q         JOIN_DATE_H
0  김철수 2023-05-01 2024-05-01       2023  2023Q2 2023-05-01 10:00:00
1  이영희 2024-01-15 2025-01-15       2024  2024Q1 2024-01-15 10:00:00
2  박민수 2024-12-01 2025-12-01       2024  2024Q4 2024-12-01 10:00:00
3  최지우 2025-05-20 2025-05-23       2025  2025Q2 2025-05-20 10:00:00

In [110]:
# 빼기
timediff= pd.Timedelta(days=1, hours=10, seconds=3)
df['JOIN_DATE_BEFORE'] = df['JOIN_DATE'] - timediff
df

,NAME,JOIN_DATE,EXIT_DATE,JOIN_YEAR,JOIN_Q,JOIN_DATE_H,JOIN_DATE_BEFORE
0,김철수,2023-05-01,2024-05-01,2023,2023Q2,2023-05-01 10:00:00,2023-04-29 13:59:57
1,이영희,2024-01-15,2025-01-15,2024,2024Q1,2024-01-15 10:00:00,2024-01-13 13:59:57
2,박민수,2024-12-01,2025-12-01,2024,2024Q4,2024-12-01 10:00:00,2024-11-29 13:59:57
3,최지우,2025-05-20,2025-05-23,2025,2025Q2,2025-05-20 10:00:00,2025-05-18 13:59:57

In [ ]:
import pandas as pd
import numpy as np

# 날짜 생성: 2025년 6월 10일부터 시작해 1시간 단위로 생성
n_sample = 500
dates = pd.date_range(start='2025-06-10 08:00:00', periods=n_sample, freq='H')

# 예제 DataFrame 생성
df = pd.DataFrame({
    'created_at': dates,
    'updated_at': dates + pd.to_timedelta(np.random.randint(1, 100, size=n_sample), unit='m'),
})

df

In [ ]:
# 특정 날짜 필터링
filtered_df = df[df['created_at'].dt.strftime('%Y-%m-%d') == '2025-06-11']
filtered_df